---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateIsSectionHidden(Autodesk.Revit.DB.SectionType,System.Boolean)
source: html/a8832575-8ce9-9af4-d8a8-8241bc5fb882.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateIsSectionHidden Method

Update if this section is hidden or not

## Syntax (C#)
```csharp
public void UpdateIsSectionHidden(
	SectionType sectionType,
	bool bHide
)
```

## Parameters
- **sectionType** (`Autodesk.Revit.DB.SectionType`) - The Section Type
- **bHide** (`System.Boolean`) - Whether to hide this section or not

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration